In [38]:
import pandas as pd

In [39]:
salary_data = pd.read_csv("Salary_Data.csv")

In [40]:
salary_data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [41]:
salary_data["Gender"] = salary_data["Gender"].map({"Male": "M", "Female": "F"})

In [42]:
salary_data.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [43]:
salary_data.shape

(6704, 6)

In [44]:
salary_data.drop('Age', axis=1, inplace=True)

In [45]:
salary_data.head()

  Gender Education Level          Job Title  Years of Experience    Salary
0      M      Bachelor's  Software Engineer                  5.0   90000.0
1      F        Master's       Data Analyst                  3.0   65000.0
2      M             PhD     Senior Manager                 15.0  150000.0
3      F      Bachelor's    Sales Associate                  7.0   60000.0
4      M        Master's           Director                 20.0  200000.0

In [46]:
df_female = salary_data[salary_data["Gender"] == "F"]
df_male = salary_data[salary_data["Gender"] == "M"]

In [47]:
df_female.head()

,Gender,Education Level,Job Title,Years of Experience,Salary
1,F,Master's,Data Analyst,3.0,65000.0
3,F,Bachelor's,Sales Associate,7.0,60000.0
6,F,Master's,Product Manager,12.0,120000.0
8,F,Bachelor's,Marketing Coordinator,1.0,45000.0
11,F,Bachelor's,HR Manager,18.0,140000.0

In [48]:
df_male.head()

  Gender Education Level          Job Title  Years of Experience    Salary
0      M      Bachelor's  Software Engineer                  5.0   90000.0
2      M             PhD     Senior Manager                 15.0  150000.0
4      M        Master's           Director                 20.0  200000.0
5      M      Bachelor's  Marketing Analyst                  2.0   55000.0
7      M      Bachelor's      Sales Manager                  4.0   80000.0

In [49]:
df_female.shape

(3014, 5)

In [50]:
df_male.shape

(3674, 5)